IoT example
<p>
Get the datatset from here: <a href="/EP-PLAN/examples/sample_datasets/iot/iot_dataset.ttl">iot_dataset.ttl</a>
</p>

<p>
To run inferences import EP-PLAN, PROV-O and PROV-O alignments. Note: At the moment, Protege doesn't resolve URIs from w3id.org properly so link directly to download locations on GITHUB for EP-PLAN and PROV-O alignments. 
</p>

<h2>Competency Questions results</h2>

<p>
Competency questions were first checked manually in Protege with the help of FACT++ reasoner and SnapSPARQL plugins.  
</p>

<h2>JENA-generated results</h2>

The following results were produced by Jena.

<pre><code>
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#> SELECT DISTINCT ?step  WHERE { &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesStep ?step. ?step a ep-plan:Step.  } 
----------------------------------------------------------
| step                                                   |
==========================================================
| &lt;http://trustlens.org/test_dataset1#DataVisualisation> |
| &lt;http://trustlens.org/test_dataset1#Storage>           |
| &lt;http://trustlens.org/test_dataset1#DataAnonymisation> |
| &lt;http://trustlens.org/test_dataset1#DataProcessing>    |
| &lt;http://trustlens.org/test_dataset1#CollectData>       |
----------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT  ?variable   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesVar ?variable.            ?variable a ep-plan:Variable. } 
----------------------------------------------------------
| variable                                               |
==========================================================
| &lt;http://trustlens.org/test_dataset1#UpdatedDatabase>   |
| &lt;http://trustlens.org/test_dataset1#Database>          |
| &lt;http://trustlens.org/test_dataset1#DataEntry>         |
| &lt;http://trustlens.org/test_dataset1#AnonymisedDataSet> |
| &lt;http://trustlens.org/test_dataset1#CollectedData>     |
| &lt;http://trustlens.org/test_dataset1#DataDashboard>     |
----------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?step ?nextStep   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesStep ?step; ep-plan:includesStep ?nextStep.      ?step ep-plan:precedes ?nextStep; a ep-plan:Step.      ?nextStep a ep-plan:Step. } 
----------------------------------------------------------------------------------------------------------------
| step                                                | nextStep                                               |
================================================================================================================
| &lt;http://trustlens.org/test_dataset1#Storage>        | &lt;http://trustlens.org/test_dataset1#DataVisualisation> |
| &lt;http://trustlens.org/test_dataset1#Storage>        | &lt;http://trustlens.org/test_dataset1#DataAnonymisation> |
| &lt;http://trustlens.org/test_dataset1#DataProcessing> | &lt;http://trustlens.org/test_dataset1#DataVisualisation> |
| &lt;http://trustlens.org/test_dataset1#DataProcessing> | &lt;http://trustlens.org/test_dataset1#Storage>           |
| &lt;http://trustlens.org/test_dataset1#DataProcessing> | &lt;http://trustlens.org/test_dataset1#DataAnonymisation> |
| &lt;http://trustlens.org/test_dataset1#CollectData>    | &lt;http://trustlens.org/test_dataset1#DataVisualisation> |
| &lt;http://trustlens.org/test_dataset1#CollectData>    | &lt;http://trustlens.org/test_dataset1#Storage>           |
| &lt;http://trustlens.org/test_dataset1#CollectData>    | &lt;http://trustlens.org/test_dataset1#DataAnonymisation> |
| &lt;http://trustlens.org/test_dataset1#CollectData>    | &lt;http://trustlens.org/test_dataset1#DataProcessing>    |
----------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?step ?variableUsed   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesStep ?step; ep-plan:includesVar ?variableUsed.      ?step a ep-plan:Step; ep-plan:hasInputVar ?variableUsed.      ?variableUsed a ep-plan:Variable. } 
-----------------------------------------------------------------------------------------------------------------
| step                                                   | variableUsed                                         |
=================================================================================================================
| &lt;http://trustlens.org/test_dataset1#DataVisualisation> | &lt;http://trustlens.org/test_dataset1#UpdatedDatabase> |
| &lt;http://trustlens.org/test_dataset1#Storage>           | &lt;http://trustlens.org/test_dataset1#Database>        |
| &lt;http://trustlens.org/test_dataset1#Storage>           | &lt;http://trustlens.org/test_dataset1#DataEntry>       |
| &lt;http://trustlens.org/test_dataset1#DataAnonymisation> | &lt;http://trustlens.org/test_dataset1#UpdatedDatabase> |
| &lt;http://trustlens.org/test_dataset1#DataProcessing>    | &lt;http://trustlens.org/test_dataset1#CollectedData>   |
-----------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?step ?variableProduced   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesStep ?step; ep-plan:includesVar ?variableProduced.      ?step a ep-plan:Step; ep-plan:hasOutputVar ?variableProduced.      ?variableProduced a ep-plan:Variable. } 
-----------------------------------------------------------------------------------------------------------------
| step                                                   | variableProduced                                     |
=================================================================================================================
| &lt;http://trustlens.org/test_dataset1#DataVisualisation> | &lt;http://trustlens.org/test_dataset1#DataDashboard>   |
| &lt;http://trustlens.org/test_dataset1#Storage>           | &lt;http://trustlens.org/test_dataset1#UpdatedDatabase> |
| &lt;http://trustlens.org/test_dataset1#DataProcessing>    | &lt;http://trustlens.org/test_dataset1#DataEntry>       |
| &lt;http://trustlens.org/test_dataset1#CollectData>       | &lt;http://trustlens.org/test_dataset1#CollectedData>   |
-----------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?executionActivity ?entity   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesVar ?variable.      ?variable a ep-plan:Variable.       ?executionTrace a ep-plan:ExecutionTraceBundle; prov:wasGeneratedBy ?executionActivity; prov:wasDerivedFrom &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:hasTraceElement ?entity.      ?executionActivity a ep-plan:MultiActivity.       ?entity a ep-plan:Entity; ep-plan:correspondsToVariable ?variable. } 
----------------------------------------------------------------------------------------------------------------------------------
| executionActivity                                               | entity                                                       |
==================================================================================================================================
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#UpdatedDatabaseEntity>   |
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#DatabaseEntity>          |
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#DataEntryEntity>         |
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#AnonymisedDatasetEntity> |
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#DataReadingsCollection>  |
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#DashBoardEntity>         |
----------------------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?executionActivity ?step   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesStep ?failedStep.      ?failedStep a ep-plan:Step.       ?executionTrace a ep-plan:ExecutionTraceBundle; prov:wasGeneratedBy ?executionActivity; prov:wasDerivedFrom &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:hasTraceElement ?activity.       ?executionActivity a ep-plan:MultiActivity.       ?activity a ep-plan:Activity; ep-plan:correspondsToStep ?step. } 
----------------------------------------------------------------------------------------------------------------------------
| executionActivity                                               | step                                                   |
============================================================================================================================
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity2> | &lt;http://trustlens.org/test_dataset1#CollectData>       |
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#Storage>           |
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#DataAnonymisation> |
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#DataProcessing>    |
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#DataVisualisation> |
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity1> | &lt;http://trustlens.org/test_dataset1#CollectData>       |
----------------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?executionActivity ?failedStep  WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesStep ?failedStep.      ?failedStep a ep-plan:Step.       ?executionTrace a ep-plan:ExecutionTraceBundle; prov:wasGeneratedBy ?executionActivity; prov:wasDerivedFrom &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:hasTraceElement ?activity.      ?executionActivity a ep-plan:MultiActivity.       ?activity a ep-plan:FailedActivity; ep-plan:correspondsToStep ?failedStep. } 
----------------------------------------------------------------------------------------------------------------------
| executionActivity                                               | failedStep                                       |
======================================================================================================================
| &lt;http://trustlens.org/test_dataset1#MainPlanExecutionActivity2> | &lt;http://trustlens.org/test_dataset1#CollectData> |
----------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?step   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesStep ?step.      ?step a ep-plan:MultiStep. } 
----------------------------------------------------
| step                                             |
====================================================
| &lt;http://trustlens.org/test_dataset1#CollectData> |
----------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?variable   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesVar ?variable.      ?variable a ep-plan:MultiVariable. } 
------------------------------------------------------
| variable                                           |
======================================================
| &lt;http://trustlens.org/test_dataset1#CollectedData> |
------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?subPlan ?step  WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesStep ?step.      ?step a ep-plan:MultiStep; ep-plan:isDecomposedAsPlan ?subPlan.      ?subPlan a ep-plan:Plan; ep-plan:isSubPlanOfPlan &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>. } 
------------------------------------------------------------------------------------------------------------
| subPlan                                               | step                                             |
============================================================================================================
| &lt;http://trustlens.org/test_dataset1#IoTCollectorPlan> | &lt;http://trustlens.org/test_dataset1#CollectData> |
------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?compositeVar ?atomicVar   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesVar ?compositeVar.      ?subPlan a ep-plan:Plan; ep-plan:isSubPlanOfPlan &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:includesVar ?atomicVar.      ?atomicVar a ep-plan:Variable.      ?compositeVar a ep-plan:MultiVariable; ep-plan:hasPart ?atomicVar. } 
--------------------------------------------------------------------------------------------------------------
| compositeVar                                       | atomicVar                                             |
==============================================================================================================
| &lt;http://trustlens.org/test_dataset1#CollectedData> | &lt;http://trustlens.org/test_dataset1#UploadedTempData> |
| &lt;http://trustlens.org/test_dataset1#CollectedData> | &lt;http://trustlens.org/test_dataset1#UploadedCo2Data>  |
--------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?variable ?subplan   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesVar ?variable.      ?subPlan a ep-plan:Plan; ep-plan:isSubPlanOfPlan &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:includesVar ?variable.      ?variable a ep-plan:Variable. } 
----------------------
| variable | subplan |
======================
----------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?compositeEntity ?atomicEntity   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesVar ?compositeVar.      ?subPlan a ep-plan:Plan; ep-plan:isSubPlanOfPlan &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:includesVar ?atomicVar.      ?atomicVar a ep-plan:Variable.      ?compositeVar a ep-plan:MultiVariable; ep-plan:hasPart ?atomicVar.       ?mainExecutionTrace a ep-plan:ExecutionTraceBundle; prov:wasDerivedFrom &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:hasTraceElement ?compositeEntity; ep-plan:hasTraceElement ?subPlanExecutionTrace.      ?subPlanExecutionTrace a ep-plan:ExecutionTraceBundle; ep-plan:hasTraceElement ?atomicEntity; prov:wasDerivedFrom ?subPlan.       ?compositeEntity a ep-plan:EntityCollection; ep-plan:correspondsToVariable ?compositeVar; prov:hadMember ?atomicEntity.      ?atomicEntity a ep-plan:Entity; ep-plan:correspondsToVariable ?atomicVar.  } 
-------------------------------------------------------------------------------------------------------------------------
| compositeEntity                                             | atomicEntity                                            |
=========================================================================================================================
| &lt;http://trustlens.org/test_dataset1#DataReadingsCollection> | &lt;http://trustlens.org/test_dataset1#UploadedTempEntity> |
| &lt;http://trustlens.org/test_dataset1#DataReadingsCollection> | &lt;http://trustlens.org/test_dataset1#UploadedCo2Entity>  |
-------------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?mainPlanEntity ?subPlanEntity   WHERE {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesVar ?variable.      ?subPlan a ep-plan:Plan; ep-plan:isSubPlanOfPlan &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:includesVar ?variable.      ?variable a ep-plan:Variable.       ?mainExecutionTrace a ep-plan:ExecutionTraceBundle; prov:wasDerivedFrom &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:hasTraceElement ?mainPlanEntity; ep-plan:hasTraceElement ?subPlanExecutionTrace.      ?subPlanExecutionTrace a ep-plan:ExecutionTraceBundle; ep-plan:hasTraceElement ?subPlanEntity; prov:wasDerivedFrom ?subPlan.       ?mainPlanEntity a ep-plan:Entity; ep-plan:correspondsToVariable ?variable.      ?subPlanEntity a ep-plan:Entity; ep-plan:correspondsToVariable ?variable; prov:mentionOf ?mainPlanEntity.  } 
----------------------------------
| mainPlanEntity | subPlanEntity |
==================================
----------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?agent ?executionTrace  WHERE  {      &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan.      ?executionTrace a ep-plan:ExecutionTraceBundle; prov:wasGeneratedBy ?executionActivity.      ?executionActivity prov:wasAssociatedWith ?agent; a ep-plan:MultiActivity.       ?executionTrace prov:wasDerivedFrom &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>.       } 
-----------------------------------------------------------------------------------------------------------------
| agent                                               | executionTrace                                          |
=================================================================================================================
| &lt;http://trustlens.org/test_dataset1#IoTSystemAgent> | &lt;http://trustlens.org/test_dataset1#ExecutionMainPlan2> |
| &lt;http://trustlens.org/test_dataset1#CityCouncil>    | &lt;http://trustlens.org/test_dataset1#ExecutionMainPlan2> |
| &lt;http://trustlens.org/test_dataset1#IoTSystemAgent> | &lt;http://trustlens.org/test_dataset1#ExecutionMainPlan1> |
| &lt;http://trustlens.org/test_dataset1#CityCouncil>    | &lt;http://trustlens.org/test_dataset1#ExecutionMainPlan1> |
-----------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?agent             WHERE {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesResponsibleAgent ?agent.      } 
-------------------------------------------------------
| agent                                               |
=======================================================
| &lt;http://trustlens.org/test_dataset1#VisTechLtd>     |
| &lt;http://trustlens.org/test_dataset1#IoTSystemAgent> |
| &lt;http://trustlens.org/test_dataset1#GoogleCloud>    |
| &lt;http://trustlens.org/test_dataset1#CityCouncil>    |
-------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?agent             WHERE {      {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesResponsibleAgent ?agent.      }      UNION {           ?subPlan ep-plan:isSubPlanOfPlan* &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:includesResponsibleAgent ?agent.      }      } 
--------------------------------------------------------
| agent                                                |
========================================================
| &lt;http://trustlens.org/test_dataset1#VisTechLtd>      |
| &lt;http://trustlens.org/test_dataset1#IoTSystemAgent>  |
| &lt;http://trustlens.org/test_dataset1#GoogleCloud>     |
| &lt;http://trustlens.org/test_dataset1#CityCouncil>     |
| &lt;http://trustlens.org/test_dataset1#TempSensorAgent> |
| &lt;http://trustlens.org/test_dataset1#IoTDeviceAgent>  |
| &lt;http://trustlens.org/test_dataset1#CO2SensorAgent>  |
| &lt;http://trustlens.org/test_dataset1#BinTechLtd>      |
--------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?agent             WHERE {                 &lt;http://trustlens.org/test_dataset1#CollectData> a ep-plan:Step; ep-plan:canBeResponsibilityOf ?agent.      } 
-------------------------------------------------------
| agent                                               |
=======================================================
| &lt;http://trustlens.org/test_dataset1#IoTDeviceAgent> |
-------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?agent        WHERE {      {           &lt;http://trustlens.org/test_dataset1#CollectData> a ep-plan:MultiStep; ep-plan:canBeResponsibilityOf ?agent.      }      UNION      {           &lt;http://trustlens.org/test_dataset1#CollectData> ep-plan:isDecomposedAsPlan ?plan.           {           ?plan a ep-plan:Plan; ep-plan:includesResponsibleAgent ?agent.           }           Union           {           ?subPlan ep-plan:isSubPlanOfPlan* ?plan; ep-plan:includesResponsibleAgent ?agent.           }      }      } 
--------------------------------------------------------
| agent                                                |
========================================================
| &lt;http://trustlens.org/test_dataset1#IoTDeviceAgent>  |
| &lt;http://trustlens.org/test_dataset1#TempSensorAgent> |
| &lt;http://trustlens.org/test_dataset1#CO2SensorAgent>  |
| &lt;http://trustlens.org/test_dataset1#BinTechLtd>      |
--------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT  ?agent ?activity            WHERE {                 &lt;http://trustlens.org/test_dataset1#CollectData> a ep-plan:Step; ep-plan:canBeResponsibilityOf ?agent.           ?agent a ep-plan:ResponsibleAgent; a ep-plan:Agent.           ?activity a ep-plan:Activity; ep-plan:correspondsToStep  &lt;http://trustlens.org/test_dataset1#CollectData> ; prov:wasAssociatedWith ?agent.      } 
-------------------------------------------------------------------------------------------------------------------
| agent                                               | activity                                                  |
===================================================================================================================
| &lt;http://trustlens.org/test_dataset1#IoTDeviceAgent> | &lt;http://trustlens.org/test_dataset1#CollectDataActivity2> |
| &lt;http://trustlens.org/test_dataset1#IoTDeviceAgent> | &lt;http://trustlens.org/test_dataset1#CollectDataActivity1> |
-------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?constraint ?step        WHERE       {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesConstraint ?constraint; ep-plan:includesStep ?step.           ?step ep-plan:hasConstraint ?constraint; a ep-plan:Step.           ?constraint a ep-plan:Constraint.      } 
---------------------------------------------------------------------------------------------------------------------
| constraint                                                     | step                                             |
=====================================================================================================================
| &lt;http://trustlens.org/test_dataset1#CollectAtLocationAberdeen> | &lt;http://trustlens.org/test_dataset1#CollectData> |
---------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?constraint ?activity        WHERE       {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> ep-plan:includesConstraint ?constraint; ep-plan:includesStep ?step.           ?step ep-plan:hasConstraint ?constraint; a ep-plan:Step.           ?constraint a ep-plan:Constraint.           ?activity ep-plan:correspondsToStep ?step; a ep-plan:Activity.           ?activity ep-plan:satisfied ?constraint.           ?execTraceBundle prov:wasDerivedFrom  &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:hasTraceElement ?activity.      } 
------------------------------------------------------------------------------------------------------------------------------
| constraint                                                     | activity                                                  |
==============================================================================================================================
| &lt;http://trustlens.org/test_dataset1#CollectAtLocationAberdeen> | &lt;http://trustlens.org/test_dataset1#CollectDataActivity1> |
------------------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?constraint ?activity        WHERE       {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> ep-plan:includesConstraint ?constraint; ep-plan:includesStep ?step.           ?step ep-plan:hasConstraint ?constraint; a ep-plan:Step.           ?constraint a ep-plan:Constraint.           ?activity ep-plan:correspondsToStep ?step; a ep-plan:Activity.           ?activity ep-plan:violated ?constraint.           ?execTraceBundle prov:wasDerivedFrom  &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>; ep-plan:hasTraceElement ?activity.      } 
------------------------------------------------------------------------------------------------------------------------------
| constraint                                                     | activity                                                  |
==============================================================================================================================
| &lt;http://trustlens.org/test_dataset1#CollectAtLocationAberdeen> | &lt;http://trustlens.org/test_dataset1#CollectDataActivity2> |
------------------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?constraint ?commsSpec        WHERE       {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesCommsSpec ?commsSpec; ep-plan:includesStep ?step.           ?commsSpec ep-plan:hasConstraint ?constraint; a ep-plan:CommsSpec.           ?constraint a ep-plan:Constraint.      } 
-----------------------------------------------------------------------------------------------------------------------
| constraint                                         | commsSpec                                                      |
=======================================================================================================================
| &lt;http://trustlens.org/test_dataset1#UseEncryption> | &lt;http://trustlens.org/test_dataset1#DataUploadOfCollectedData> |
-----------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?constraint ?variable        WHERE       {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan>  a ep-plan:Plan; ep-plan:includesCommsSpec ?commsSpec; ep-plan:includesStep ?step1; ep-plan:includesStep ?step2; ep-plan:includesVar ?variable.           ?commsSpec ep-plan:hasConstraint ?constraint; a ep-plan:CommsSpec.           ?constraint a ep-plan:Constraint.           ?commsSpec ep-plan:hasSender ?step1; ep-plan:hasRecipient?step2; ep-plan:hasPayload ?variable.           ?variable a ep-plan:Variable.           ?step1 a ep-plan:Step.           ?step2 a ep-plan:Step.      } 
-----------------------------------------------------------------------------------------------------------
| constraint                                         | variable                                           |
===========================================================================================================
| &lt;http://trustlens.org/test_dataset1#UseEncryption> | &lt;http://trustlens.org/test_dataset1#CollectedData> |
-----------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?constraint ?senderActivity ?recipientActivity ?exchangedData       WHERE       {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesCommsSpec ?commsSpec; ep-plan:includesStep ?sender; ep-plan:includesStep ?recipient; ep-plan:includesVar ?variable.            ?senderActivity a ep-plan:Activity; ep-plan:correspondsToStep ?sender.           ?exchangedData a ep-plan:Entity; prov:wasGeneratedBy ?senderActivity; ep-plan:correspondsToVariable ?variable.            ?recipientActivity a ep-plan:Activity; prov:used ?exchangedData; prov:qualifiedCommunication ?communication;ep-plan:correspondsToStep ?recipient.           ?communication a ep-plan:Communication; ep-plan:correspondsToCommsSpec ?commsSpec; prov:activity ?senderActivity.                      ?commsSpec ep-plan:hasConstraint ?constraint; a ep-plan:CommsSpec.           ?commsSpec ep-plan:hasSender ?sender; ep-plan:hasRecipient ?recipient; ep-plan:hasPayload ?variable.           ?communication ep-plan:satisfied ?constraint.      } 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
| constraint                                         | senderActivity                                            | recipientActivity                                           | exchangedData                                               |
==============================================================================================================================================================================================================================================
| &lt;http://trustlens.org/test_dataset1#UseEncryption> | &lt;http://trustlens.org/test_dataset1#CollectDataActivity1> | &lt;http://trustlens.org/test_dataset1#DataProcessingActivity> | &lt;http://trustlens.org/test_dataset1#DataReadingsCollection> |
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?policy       WHERE       {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesPolicy ?policy.            ?policy a ep-plan:Policy.      } 
-------------------------------------------------------------
| policy                                                    |
=============================================================
| &lt;http://trustlens.org/test_dataset1#ExecutionPolicy>      |
| &lt;http://trustlens.org/test_dataset1#DataProtectionPolicy> |
-------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?policy ?planElement       WHERE       {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesPolicy ?policy; ep-plan:includesPlanElement ?planElement.            ?policy a ep-plan:Policy; a ep-plan:Rationale.           ?planElement a ep-plan:PlanElement; ep-plan:hasRationale ?policy.      } 
------------------------------------------------------------------------------------------------------------------------------
| policy                                                    | planElement                                                    |
==============================================================================================================================
| &lt;http://trustlens.org/test_dataset1#ExecutionPolicy>      | &lt;http://trustlens.org/test_dataset1#CollectAtLocationAberdeen> |
| &lt;http://trustlens.org/test_dataset1#DataProtectionPolicy> | &lt;http://trustlens.org/test_dataset1#UseEncryption>             |
------------------------------------------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?policyRationale       WHERE       {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesPolicy &lt;http://trustlens.org/test_dataset1#DataProtectionPolicy>.           &lt;http://trustlens.org/test_dataset1#DataProtectionPolicy> a ep-plan:Policy; ep-plan:hasRationale ?policyRationale.            ?policyRationale a ep-plan:Rationale.       } 
-----------------------------------------------------------------------------------------------
| policyRationale                                                                             |
===============================================================================================
| &lt;http://openscience.adaptcentre.ie/ontologies/GDPRtEXT/deliverables/gdpr.ttl#article32-1-a> |
-----------------------------------------------------------------------------------------------
PREFIX ep-plan:&lt;https://w3id.org/ep-plan#> PREFIX prov:&lt;http://www.w3.org/ns/prov#>  SELECT DISTINCT ?objective       WHERE       {           &lt;http://trustlens.org/test_dataset1#HomeMonitoringHighLevelPlan> a ep-plan:Plan; ep-plan:includesObjective ?objective.           ?objective a ep-plan:Objective.            OPTIONAL {           ?rationale a ep-plan:Rationale; ep-plan:isRationaleOf  ?objective.           }      }
----------------------------------------------------------
| objective                                              |
==========================================================
| &lt;http://trustlens.org/test_dataset1#DataDashboard>     |
| &lt;http://trustlens.org/test_dataset1#AnonymisedDataSet> |
----------------------------------------------------------
</code></pre>
